/*
 * welcome.c
 *
 *  Created on: 2015年7月15日
 *      Author: yuan
 */

#include "welcome.h"


/**
 * 欢迎界面
 */
void
welcome() {
	printf("\n");
	printf("|============================================================================|\n");
	printf("|============================================================================|\n");
	printf("|===============================>> 虚拟目录 <<=================================|\n");
	printf("|============================================================================|\n");
	printf("|============================================================================|\n");
	printf("\n");
	while(getchar() == 0);
}


/**
 * 主菜单：功能列表
 */
void
main_menu() {

	printf("\n");
	printf("|============================================================================|\n");
	printf("|===============================>> 功能列表 <<=================================|\n");
	printf("|============================================================================|\n");
	printf("\n");

	function_list();		//功能列表
}


/**
 * 帮助菜单
 */
void
help_menu() {

	printf("\n");
	printf("|============================================================================|\n");
	printf("|================================>> 帮助 <<===================================|\n");
	printf("|============================================================================|\n");
	printf("\n");

	function_list();		//功能列表

}


/**
 * 功能列表
 */
void
function_list() {

	printf("ls\t\t\t\t\t\t列出所有磁盘名、目录名和文件名\n");
	printf("ls -l\t\t\t\t\t\t列出所有磁盘、目录及文件的基本信息\n");
	printf("ls -l 文件名\t\t\t\t\t列出指定文件的基本信息\n");
	printf("ls -***\t\t\t\t\t\t列出所有磁盘、目录及文件的详细信息\n");
	printf("ls -*** 文件名\t\t\t\t\t列出指定文件的详细信息\n");
	printf("open 磁盘名\t\t\t\t\t进入指定磁盘\n");
	printf("cd 目录名\t\t\t\t\t\t切换到指定目录\n");
	printf("cd ..\t\t\t\t\t\t返回父目录\n");
	printf("cd /\t\t\t\t\t\t返回根目录\n");
	printf("pwd\t\t\t\t\t\t显示当前工作目录\n");
	printf("find time 开始日期 终止日期\t\t\t在当前目录下检索日期范围内的文件\n");
	printf("find /time 开始日期 终止日期\t\t\t从根目录开始检索日期范围内的文件\n");
	printf("location 起始赤经 终止赤经 起始赤纬 终止赤纬\t\t在当前目录下检索指定位置范围内的文件\n");
	printf("/location 起始赤经 终止赤经 起始赤纬 终止赤纬\t\t从根目录开始检索指定位置范围内的文件\n");
	printf("cp 文件名\t\t\t\t\t\t复制指定目录下的文件到特定路径下\n");
	printf("cp 目录名\t\t\t\t\t\t复制指定文件到特定路径下\n");
	printf("get 文件名\t\t\t\t\t获取指定文件\n");
	printf("history\t\t\t\t\t\t获取当天操作日志\n");
	printf("history 指定日期（20150101）\t\t\t获取指定日期操作日志\n");
	printf("history -a\t\t\t\t\t获取所有操作日志信息\n");
	printf("help\t\t\t\t\t\t帮助菜单\n");
	printf("\n");

}

